
def print_main_menu(session_active: bool):

    color = "\033[0m"

    if session_active == False:
        text = [
            "Добро пожаловать в электронную версию школьной библиотеки!", 
            "1. Войти как студент.", 
            "2. Войти как администратор.",
            "3. Выйти из программы",
        ]

        for i in text:
            print(color + i.center(130))

    else:
        text = [            
            "Добро пожаловать в электронную версию школьной библиотеки!",  
            "1. Вернуться",
            "2. Выйти из аккаунта",
            "3. Выйти из программы",
        ]

        for i in text:
            print(color + i.center(130))

def print_set(style: int):

    if style == 1:
        print(f"{'\n|Настройки':<21}",
            f"|{'='*19}",
            f"{'|1.Поменять цвет':<20}",
            f"{'|2.Поменять стиль':<20}|",
        sep=f"|\n"
    )

    elif style == 2:
        print("\nНастройки",
            "1.Поменять цвет",
            "2.Поменять стиль",
        sep="\n"
    )

    elif style == 3:
        print(f"{'\n|Настройки':<21}",
            f"|{'='*19}",
            f"{'|1.Поменять цвет':<20}",
            f"|{'-'*19}",
            f"{'|2.Поменять стиль':<20}",
            f"|{'-'*19}|",
        sep=f"|\n"
    )

def print_stud_menu(style: int, color):

    if style == 1:
        print(color +
            f"{'\n|Меню студента':<24}",
            f"|{'='*22}",
            f"{'|1.Каталог книг':<23}",
            f"{'|2.Поиск книг':<23}",
            f"{'|3.Оформить выдачу':<23}",
            f"{'|4.Мои активные выдачи':<23}",
            f"{'|5.Вернуть книгу':<23}",
            f"{'|6.Выйти в главное меню':<23}",
            f"{'|7.Настройки':<23}|",
            sep="|\n"
    )

    elif style == 2:
        print(
            "\nМеню студента",
            "1.Каталог книг",
            "2.Поиск книг",
            "3.Оформить выдачу",
            "4.Мои активные выдачи",
            "5.Вернуть книгу",
            "6.Выйти в главное меню",
            "7.Настройки",
            sep="\n"
    )

    elif style == 3:
        print(
            f"{'\n|Меню студента':<24}",
            f"|{'='*22}",
            f"{'|1.Каталог книг':<23}",
            f"|{'-'*22}",
            f"{'|2.Поиск книг':<23}",
            f"|{'-'*22}",
            f"{'|3.Оформить выдачу':<23}",
            f"|{'-'*22}",
            f"{'|4.Мои активные выдачи':<23}",
            f"|{'-'*22}",
            f"{'|5.Вернуть книгу':<23}",
            f"|{'-'*22}",
            f"{'|6.Выйти в главное меню':<23}",
            f"|{'-'*22}",
            f"{'|7.Настройки':<23}",
            f"|{'-'*22}|",
            sep="|\n"
    )